---
kind: method
id: M:Autodesk.Revit.DB.ConnectorSet.Clear
source: html/064708c0-2a8d-998c-fe06-5b8d23e5bf8c.htm
---
# Autodesk.Revit.DB.ConnectorSet.Clear Method

Removes every item from the set, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```